[
    {
        "id": "veganism-kills-animals",
        "category": "ethics",
        "claim": "Veganism kills more animals through crop harvesting.",
        "fact": "Animal agriculture requires vastly more crops to feed livestock than would be needed to feed humans directly. a vegan diet actually requires less land and results in fewer total crop deaths than an omnivorous diet.",
        "citations": [
            {
                "title": "the opportunity cost of animal based diets exceeds all food losses",
                "url": "https://www.pnas.org/doi/10.1073/pnas.1713820115"
            }
        ]
    },
    {
        "id": "veganism-not-enough-land",
        "category": "environment",
        "claim": "Veganism requires too much land.",
        "fact": "Animal agriculture requires vastly more land to feed livestock than would be needed to feed humans directly. a vegan diet actually requires less land and results in fewer total crop deaths than an omnivorous diet.",
        "citations": [
            {
                "title": "the opportunity cost of animal based diets exceeds all food losses",
                "url": "https://www.pnas.org/doi/10.1073/pnas.1713820115"
            },
            {
                "title": "If the world adopted a plant-based diet, we would reduce global agricultural land use from 4 to 1 billion hectares",
                "url": "https://ourworldindata.org/land-use-diets"
            },
            {
                "title": "land use for food production",
                "url": "https://ourworldindata.org/grapher/land-use-kcal-poore"
            }
        ]
    },
    {
        "id": "veganism-elitist",
        "category": "ethics",
        "claim": "Veganism is elitist and not accessible to everyone.",
        "fact": "Vegan diets are most often cheaper than omnivorous ones, saving individuals up to 19% on food costs. basic plant staples like legumes, grains, and vegetables are widely available and affordable across most regions. perceptions of elitism usually stem from marketing of premium vegan products, not the core diet itself. numerous community initiatives and government programs support access to plant-based foods, especially in underserved areas. with proper planning, a vegan diet is financially and logistically accessible to people from diverse socioeconomic backgrounds.",
        "citations": [
            {
                "title": "plant-based diets: a physician's guide",
                "url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3662288/"
            },
            {
                "title": "eating vegan diet reduces grocery bill 16% savings more than $500 a year",
                "url": "https://www.pcrm.org/news/news-releases/eating-vegan-diet-reduces-grocery-bill-16-savings-more-500-year-finds-new?utm_source=chatgpt.com"
            }
        ]
    },
    {
        "id": "dairy-humane",
        "category": "ethics",
        "claim": "Dairy production is humane and doesn't harm animals.",
        "fact": "Dairy farming routinely involves practices that raise serious ethical concerns. in nearly all commercial dairy operations, calves are separated from their mothers within hours or days after birth to maximize milk production for human consumption. this early separation is highly stressful for both cow and calf, often resulting in prolonged vocalizations, signs of distress, and elevated cortisol levels. male calves, who cannot produce milk and are considered less economically valuable, are frequently culled shortly after birth or sold into the veal industry, where they are confined and slaughtered at a young age. female calves are typically raised to replace their mothers in the cycle of forced impregnation and milk extraction. to maintain high yields, dairy cows are impregnated annually, leading to physical strain, mastitis (a painful udder infection), and shortened lifespans — typically just 4–6 years compared to their natural lifespan of 20 years. these practices are standard in both conventional and many so-called 'humane' or 'organic' dairy farms, underscoring systemic welfare issues embedded in the dairy industry.",
        "citations": [
            {
                "title": "animal welfare in dairy production",
                "url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6627353/"
            }
        ]
    },
    {
        "id": "veganism-insufficient",
        "category": "environment",
        "claim": "Veganism alone won't solve environmental issues.",
        "fact": "While no single action can address all environmental problems, adopting a plant-based diet is one of the most effective ways individuals can reduce their environmental footprint, including greenhouse gas emissions, land use, and water consumption.",
        "citations": [
            {
                "title": "reducing food's environmental impacts through producers and consumers",
                "url": "https://science.sciencemag.org/content/360/6392/987"
            }
        ]
    },
    {
        "id": "evolved-to-eat-meat",
        "category": "health",
        "claim": "Humans evolved to eat meat, so it's natural and necessary.",
        "fact": "This is the 'appeal to nature' fallacy - just because something is natural, it is not necessarily good or necessary. while humans are omnivorous and have historically consumed both plant and animal foods, modern nutritional science shows that a well-planned vegan diet can provide all essential nutrients. the 'naturalness' of meat consumption doesn't imply necessity or optimal health.",
        "citations": [
            {
                "title": "position of the academy of nutrition and dietetics: vegetarian diets",
                "url": "https://pubmed.ncbi.nlm.nih.gov/27886704/"
            },
            {
                "title": "the appeal to nature fallacy",
                "url": "https://en.wikipedia.org/wiki/Appeal_to_nature"
            }
        ]
    },
    {
        "id": "soy-estrogen",
        "category": "health",
        "claim": "Soy increases estrogen levels and is harmful.",
        "fact": "Soy contains isoflavones, plant-derived compounds that can bind to estrogen receptors but have much weaker effects than human estrogen. studies indicate that moderate soy consumption does not increase estrogen levels in humans and may offer health benefits, such as reducing menopausal symptoms and lowering the risk of certain cancers.",
        "citations": [
            {
                "title": "does eating soy increase estrogen and cause breast cancer?",
                "url": "https://www.mskcc.org/news/does-eating-soy-increase-estrogen-and-cause-breast"
            },
            {
                "title": "is soy bad for you? no, here's the research",
                "url": "https://www.goodrx.com/well-being/diet-nutrition/debunked-myths-about-soy"
            },
            {
                "title": "is soy good or bad for you? nutritionists settle the debate",
                "url": "https://www.realsimple.com/is-soy-bad-for-you-8553142"
            }
        ]
    },
    {
        "id": "local-meat-better",
        "category": "environment",
        "claim": "Eating local meat is more sustainable than imported plant foods.",
        "fact": "Transportation contributes a very small fraction to food's total greenhouse gas emissions. the majority comes from production, especially in animal agriculture. plant-based diets generally have a lower environmental impact, even when considering transportation.",
        "citations": [
            {
                "title": "food-miles and the relative climate impacts of food choices in the united states",
                "url": "https://pubs.acs.org/doi/10.1021/es702969f"
            }
        ]
    },
    {
        "id": "protein-deficiency",
        "category": "health",
        "claim": "You can't get enough protein on a vegan diet.",
        "fact": "A well-planned vegan diet provides all essential amino acids and adequate protein levels. Foods like legumes, tofu, seitan, and quinoa are excellent sources of plant-based protein. The average vegan easily meets or exceeds daily protein requirements.",
        "citations": [
            {
                "title": "Academy of Nutrition and Dietetics: Position on vegetarian diets",
                "url": "https://pubmed.ncbi.nlm.nih.gov/27886704/"
            },
            {
                "title": "Protein and amino acid content in selected plant foods",
                "url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6893534/"
            }
        ]
    },
    {
        "id": "plants-feel-pain",
        "category": "ethics",
        "claim": "Plants feel pain.",
        "fact": "There's no scientific evidence that plants have nervous systems, pain receptors, or consciousness - all requirements for feeling pain. Plants respond to stimuli, but this is not the same as feeling pain or suffering.",
        "citations": [
            {
                "title": "Plant Consciousness: The Fascinating Evidence",
                "url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8052213/"
            }
        ]
    },
    {
        "id": "b12-deficiency",
        "category": "health",
        "claim": "Vegans lack B12.",
        "fact": "B12 supplements are recommended for vegans, just as they are for many people over 50 regardless of diet. Many vegan foods are fortified with B12, and a properly planned vegan diet with supplementation provides adequate B12. Importantly, most livestock are also given B12 supplements because modern farming practices and diets do not provide enough naturally. Getting B12 directly is a more efficient use of resources than filtering it through animal agriculture.",
        "citations": [
            {
                "title": "Vitamin B12 in the Vegan Diet",
                "url": "https://veganhealth.org/vitamin-b12/"
            },
            {
                "title": "Safety and efficacy of vitamin B12 (in the form of cyanocobalamin) produced by Ensifer spp. as a feed additive for all animal species based on a dossier submitted by VITAC EEIG",
                "url": "https://www.efsa.europa.eu/en/efsajournal/pub/5336"
            }
        ]
    },
    {
        "id": "environment-impact",
        "category": "environment",
        "claim": "Veganism doesn't make a difference for the environment.",
        "fact": "Animal agriculture is a leading cause of greenhouse gas emissions, deforestation, water usage, and pollution. Research shows that plant-based diets can reduce your carbon footprint by up to 73%.",
        "citations": [
            {
                "title": "Reducing food's environmental impacts through producers and consumers",
                "url": "https://science.sciencemag.org/content/360/6392/987"
            }
        ]
    },
    {
        "id": "vegan-athlete-protein",
        "category": "health",
        "claim": "Vegan athletes can't get enough protein to build muscle or perform at a high level.",
        "fact": "Multiple recent studies show that well-planned plant-based diets, when scaled to meet energy needs, provide all the protein and essential amino acids required for maximal muscle mass, strength, and athletic performance. Vegan athletes like Nimai Delgado have built world-class physiques and excelled in bodybuilding without ever eating animal products. Research in professional football players and bodybuilders found that plant-based diets easily meet or exceed the recommended 1.6–2.2 g/kg/day protein for athletes, and also provide sufficient leucine for muscle protein synthesis. The myth that vegan athletes can't get enough protein is not supported by science or real-world results.",
        "citations": [
            {
                "title": "Protein Requirements for Maximal Muscle Mass and Athletic Performance Are Achieved with Completely Plant-Based Diets Scaled to Meet Energy Needs: A Modeling Study in Professional American Football Players",
                "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC11206900"
            },
            {
                "title": "Can Athletes Get Enough Protein and Leucine on a Plant-based Diet? New Modeling Studies Say Yes",
                "url": "https://switch4good.org/protein-and-leucine-on-a-plant-based-diet/"
            },
            {
                "title": "Nimai Delgado – Professional Body Builder and Vegan Athlete",
                "url": "https://theproof.com/nimai-delgado-professional-body-builder-and-vegan-athlete/"
            }
        ]
    }
]